In [1]:
import numpy as np
import pandas as pd

In [2]:
# Level 3 : Data Cleaning
# 11. Replace missing values with the mean.
# 12. Drop rows with missing values.
# 13. Check how many null values each column has.
# 14. Convert a column datatype.
# 15. Remove duplicate rows.

## 11  Replace missing values with the mean.

In [10]:

data = {
    'Employee_ID': [1, 2, 3, 4, 5],
    'Name': ['John Doe', 'Jane Smith', 'Sanjeev_KhadkaX', 'Emily Brown', 'David Wilson'],
    'Department': ['Sales', 'Marketing', 'CEO', 'HR', 'Finance'],
    'Salary': [50000, None, 10000000, 8000, 9000]
}

df = pd.DataFrame(data)
print(df)

result = df.fillna(df['Salary'].mean())


print(result)

   Employee_ID             Name Department      Salary
0            1         John Doe      Sales     50000.0
1            2       Jane Smith  Marketing         NaN
2            3  Sanjeev_KhadkaX        CEO  10000000.0
3            4      Emily Brown         HR      8000.0
4            5     David Wilson    Finance      9000.0
   Employee_ID             Name Department      Salary
0            1         John Doe      Sales     50000.0
1            2       Jane Smith  Marketing   2516750.0
2            3  Sanjeev_KhadkaX        CEO  10000000.0
3            4      Emily Brown         HR      8000.0
4            5     David Wilson    Finance      9000.0

## 12 Drop rows with missing values.

In [14]:
print(df)
result = df.dropna()

   Employee_ID             Name Department      Salary
0            1         John Doe      Sales     50000.0
1            2       Jane Smith  Marketing         NaN
2            3  Sanjeev_KhadkaX        CEO  10000000.0
3            4      Emily Brown         HR      8000.0
4            5     David Wilson    Finance      9000.0

## 13 Check How many null values each column has

In [16]:
print(df)
result = df.isna().sum()
print(result)

   Employee_ID             Name Department      Salary
0            1         John Doe      Sales     50000.0
1            2       Jane Smith  Marketing         NaN
2            3  Sanjeev_KhadkaX        CEO  10000000.0
3            4      Emily Brown         HR      8000.0
4            5     David Wilson    Finance      9000.0
Employee_ID    0
Name           0
Department     0
Salary         1
dtype: int64

## 14 Convert a column datatype

In [23]:
print(df.dtypes)
df.fillna(df['Salary'].mean(),inplace=True)
df['Salary'] = df['Salary'].astype(int)
print(df.dtypes)

Employee_ID      int64
Name            object
Department      object
Salary         float64
dtype: object
Employee_ID     int64
Name           object
Department     object
Salary          int64
dtype: object

## 15 Remove Duplicate Rows

In [ ]:

data = {
    'Employee_ID': [1, 2, 2, 3, 3, 3],
    'Name': ['John Doe', 'Jane Smith', 'Jane Smith', 'Mike Johnson', 'Mike Johnson', 'Mike Johnson'],
    'Department': ['Sales', 'Marketing', 'Marketing', 'Engineering', 'Engineering', 'Engineering'],
    'Salary': [50000, 60000, 60000, 70000, 70000, 70000]
}

df = pd.DataFrame(data)
print(df)
print()

# Drop duplicate rows based on all columns
df_without_duplicates = df.drop_duplicates()

print(df_without_duplicates)

   Employee_ID          Name   Department  Salary
0            1      John Doe        Sales   50000
1            2    Jane Smith    Marketing   60000
2            2    Jane Smith    Marketing   60000
3            3  Mike Johnson  Engineering   70000
4            3  Mike Johnson  Engineering   70000
5            3  Mike Johnson  Engineering   70000

   Employee_ID          Name   Department  Salary
0            1      John Doe        Sales   50000
1            2    Jane Smith    Marketing   60000
3            3  Mike Johnson  Engineering   70000

: